# SculptingCurvesCannotFormClosedLoop Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..SculptingCurvesCannotFormClosedLoop Property
BuiltInFailures..::..SketchFailures Class See Also
---
Curves cannot form a closed loop.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SculptingCurvesCannotFormClosedLoop { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SculptingCurvesCannotFormClosedLoop As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SculptingCurvesCannotFormClosedLoop {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace